Repository: DutChen18/cobra
Catalog: locale/*.po
Languages: cs_cz, ja_jp, nl_nl, sl_si, sv_se, uk_ua

source: path to configuration file
cs_cz: cesta ke konfiguračnímu souboru
ja_jp: コンフィグのパス
nl_nl: pad naar configuratiebestand
sl_si: pot do konfiguracijske datoteke
sv_se: sökväg till konfigurationsfil
uk_ua: шлях до файлу конфігурації

source: number of threads to use (implies -t)
cs_cz: počet vláken (automaticky zapíná -t)
ja_jp: スレッド数
nl_nl: aantal threads om te gebruiken (impliceert -t)
sl_si: željeno število niti (implicira -t)
sv_se: antal trådar att använda
uk_ua: скільки потоків використовувати (передбачає -t)

source: write diagnostics in json format
cs_cz: zapisovat diagnostiku ve formátu json
ja_jp: 診断メッセージをJSON形式で書きます
nl_nl: schrijf diagnostiek in json formaat
sl_si: izpiši diagnostiko v json formatu
sv_se: skriv diagnostik i json-format
uk_ua: виводити діагностику в форматі json

source: exit after reading configuration file
cs_cz: skončit po přečtení konfiguračního souboru
ja_jp: コンフィグを読み込んでからすぐ終了します
nl_nl: sluit af na het inlezen van het configuratiebestand
sl_si: končaj po branju konfiguracijske datoteke
sv_se: avsluta efter att ha läst konfigurationsfilen
uk_ua: вийти після прочитання файлу конфігурації

source: display this help message
cs_cz: zobrazit tuto pomocnou zprávu
ja_jp: このメッセージを表示します
nl_nl: vertoon dit hulpbericht
sl_si: prikaži to sporočilo
sv_se: visa detta hjälpmeddelandet
uk_ua: вивести це повідомлення

source: use the thread pool executor
cs_cz: použít více vláken
ja_jp: スレッドプールを使います
nl_nl: gebruik de uitvoerder van threadpools
sl_si: uporabi izvajalca sklada niti
sv_se: använd trådpoolsexekveraren
uk_ua: використовувати багатопотокового виконавця

source: show verbose output
cs_cz: zobrazit zdlouhavý výstup
ja_jp: 詳しいログを表示します
nl_nl: uitgebreide uitvoer weergeven
sl_si: prikaži razširjen izpis
sv_se: visa utförlig utdata
uk_ua: показувати розширену інформацію

source: error
cs_cz: chyba
ja_jp: エラー
nl_nl: fout
sl_si: napaka
uk_ua: помилка

source: warning
cs_cz: varování
ja_jp: 警告
nl_nl: waarschuwing
sl_si: opozorilo
sv_se: varning
uk_ua: застереження

source: note
cs_cz: poznámka
ja_jp: ノート
nl_nl: notitie
sl_si: opomba
sv_se: notera
uk_ua: примітка

source: unexpected EOF
cs_cz: neočekávaný EOF
ja_jp: 予想されていないEOFです
nl_nl: onverwachte EVB
sl_si: nepričakovan EOF
sv_se: oväntat slut på filen
uk_ua: неочікуваний кінець файлу

source: expected `{}`
cs_cz: očekáváno `{}`
ja_jp: `{}`が予想されます
nl_nl: verwachte `{}`
sl_si: pričakovan `{}`
sv_se: förväntade `{}`
uk_ua: очікувано `{}`

source: unexpected `{}`
cs_cz: neočekávané `{}`
ja_jp: 予想されていない`{}`
nl_nl: onverwachte `{}`
sl_si: nepričakovan `{}`
sv_se: oväntat `{}`
uk_ua: неочікуваний `{}`

source: unexpected word
cs_cz: neočekávané slovo
ja_jp: 予想されていないワード
nl_nl: unverwacht woord
sl_si: nepričakovana beseda
sv_se: oväntat ord
uk_ua: неочікуване слово

source: consider replacing `{}` with `{}`
cs_cz: zvažte nahrazení `{}` za `{}`
ja_jp: `{}`を`{}`に変更されてはどうですか？
nl_nl: overweeg om `{}` te vervangen met `{}`
sl_si: razmislite o zamenjavi `{}` z `{}`
sv_se: överväg att ersätta `{}` med `{}`
uk_ua: спробуйте замінити `{}` на `{}`

source: unclosed quote
cs_cz: neuzavřené uvozovky
ja_jp: 終端の"文字がありません
nl_nl: ongesloten aanhalingstekens
sl_si: nezaključen narekovaj
sv_se: oavslutat citat
uk_ua: незаркиті лапки

source: invalid word
cs_cz: neplatné slovo
ja_jp: 無効なワードです
nl_nl: ongeldig woord
sl_si: neveljavna beseda
sv_se: ogiltigt ord
uk_ua: некопектне слово

source: expected at least one character
cs_cz: očekáván alespoň jeden znak
ja_jp: 少なとも一つの文字が予想されます
nl_nl: verwachtte minimaal één karakter
sl_si: pričakovan vsaj en znak
sv_se: förväntade minst ett tecken
uk_ua: очікувано принаймі 1 символ

source: expected at least one graphical character
cs_cz: očekáván alespoň jeden viditelný znak
ja_jp: 表示できる文字が予想されます
nl_nl: verwachtte minimaal één grafisch karakter
sl_si: pričakovan vsaj en grafični znak
sv_se: förväntade minst ett grafiskt tecken
uk_ua: очікувано принаймі 1 графічний символ

source: regular file
cs_cz: obyčejný soubor
ja_jp: 普通のファイル
nl_nl: regulier bestand
sl_si: navadna datoteka
sv_se: vanlig fil
uk_ua: звичайним файлом

source: directory
cs_cz: adresář
sl_si: mapa
sv_se: mapp
uk_ua: папкою

source: symlink
ja_jp: シンボリックリンク
nl_nl: symbolische link
sl_si: simbolična povezava
sv_se: symbolisk länk
uk_ua: посиланням

source: block device
cs_cz: blokové zařízení
ja_jp: ブロックデバイス
nl_nl: blok apparaat
sl_si: bločna naprava
sv_se: blockera enhet
uk_ua: блочним пристроєм

source: character device
cs_cz: znakové zařízení
ja_jp: キャラクタデバイス
nl_nl: karakter apparaat
sl_si: znakovna naprava
sv_se: teckenenhet
uk_ua: символьним пристроєм

source: socket
ja_jp: ソケット
nl_nl: stopcontact
sl_si: vtičnik
uk_ua: сокетом

source: unknown
cs_cz: neznámý
ja_jp: 不明
nl_nl: onbekend
sl_si: neznano
sv_se: okänd
uk_ua: невідомо чим

source: failed to stat file
cs_cz: nepovedlo se provést stat na souboru
ja_jp: ファイルをstatできませんでした
nl_nl: kon stat niet uitvoeren op bestand
sl_si: napaka pri izvršitvi stat na datoteki
sv_se: misslyckade att exekvera stat för filen
uk_ua: не вдалося виконати stat

source: not a normal file
cs_cz: neobyčejný soubor
ja_jp: 普通のファイルではありません
nl_nl: niet een normaal bestand
sl_si: ni navadna datoteka
sv_se: inte en vanlig fil
uk_ua: не є звичайним файлом

source: is a directory
cs_cz: je adresář
ja_jp: ディレクトリです
nl_nl: is een map
sl_si: je mapa
sv_se: är en mapp
uk_ua: є папкою

source: not an executable file
cs_cz: nespustitelný soubor
ja_jp: 実行形式的なファールではありません
nl_nl: niet een uitvoerbaar bestand
sl_si: ni izvršljiva datoteka
sv_se: inte en exekverbar fil
uk_ua: не є виконуваним файлом

source: invalid response code
cs_cz: neplatný kód odpovědi
ja_jp: 無効なステータス
sl_si: neveljavna odzivna koda
sv_se: ogiltigt svarskod
uk_ua: некоректний код відповіді

source: invalid redirect code
cs_cz: neplatný kód přesměrování
ja_jp: 無効なリダイレクトコード
sl_si: neveljavna preusmeritvena koda
sv_se: ogiltig omdirigeringskod
uk_ua: некоректний код перенаправлення

source: suspicious redirect code
cs_cz: podivný kód přesměrování
ja_jp: 怪しいリダイレクトコード
nl_nl: verdachte omleidingscode
sl_si: sumljiva preusmeritvena koda
sv_se: misstänksam omdirigeringskod
uk_ua: підозрілий код перенаправлення

source: did you mean one of: {}, {}, {}, {}?
cs_cz: měli jste na mysli jedno z následujících: {}, {}, {}, {}?
ja_jp: {}, {}, {}, {}を使おうとされましたか？
nl_nl: bedoelde u {}, {}, {}, of {}?
sl_si: ali ste mislili enega izmed: {}, {}, {}, {}?
sv_se: menade du någon av: {}, {}, {}, {}?
uk_ua: можливо ви мали на увазі один з: {}, {}, {}, {}?

source: not a directory
cs_cz: není adresář
ja_jp: ディレクトリではありません
nl_nl: niet een map
sl_si: ni mapa
sv_se: inte en mapp
uk_ua: не є папкою

source: is a {}
cs_cz: je
ja_jp: {} です
nl_nl: is een {}
sl_si: je {}
sv_se: är en {}
uk_ua: є {}

source: empty filter
cs_cz: prázdný filtr
ja_jp: フィルターが空っぽです
nl_nl: lege filter
sl_si: prazen filter
sv_se: tomt filter
uk_ua: порожній фільтр

source: consider specifying a handler using: `static`, `cgi`, etc...
cs_cz: zvažte specifikování handleru pomocí: `static`, `cgi`, atd...
sl_si: razmislite o tem, da bi določili izvajalca z uporabo: `static`, `cgi` itd...
sv_se: överväg att ange en handerare med: `static`, `cgi`, osv...
uk_ua: спробуйте вказати обробника запитів використовуючи: `static`, `cgi`, і т.д.

source: a address cannot be listened to with and without ssl at the same time
cs_cz: nelze odposlouchávat adresu zároveň s a bez ssl
ja_jp: 一つのアドレスは同時にSSLなしとSSLを使ってリスニングできません
nl_nl: een adres kan niet tegelijkertijd met en zonder ssl worden beluisterd
sl_si: naslova ni mogoče hkrati poslušati z in brez ssl
sv_se: kan inte lyssna på en adress med och utan ssl samtidigt
uk_ua: адреса не може одночасно прослуховуватись з і без ssl

source: consider listening to another address
cs_cz: zvažte odposlouchávat na jiné adrese
ja_jp: 他のアドラスをお使いになってはどうですか？
nl_nl: overweeg om naar een ander adres te luisteren
sl_si: razmislite o poslušanju drugega naslova
sv_se: överväg att lyssna på en annan adress
uk_ua: спробуйте прослуховувати іншу адресу

source: previously listened to here without ssl
cs_cz: původně odposloucháváno odsud bez ssl
ja_jp: すでにここにSSLなし使っています
nl_nl: eerder hier beluisterd zonder ssl
sl_si: prej poslušal tukaj brez ssl
sv_se: tidigare lyssnat på här utan ssl
uk_ua: попередньо ця адреса прослуховувалась без ssl

source: previously listened to here with ssl
cs_cz: původně odposloucháváno odsud s ssl
ja_jp: すでにここにSSLを使っています
nl_nl: eerder hier beluisterd met ssl
sl_si: prej poslušal tukaj z ssl
sv_se: tidigare lyssnat på här med ssl
uk_ua: попередньо ця адреса прослуховувалась з ssl

source: ambiguous server
cs_cz: nejednoznačný server
sl_si: dvoumen strežnik
sv_se: tvetydig server
uk_ua: неоднозначний сервер

source: consider specifying a `server_name`
cs_cz: zvažte specifikování `server_name`
ja_jp: `server_name`をお使いになってはどうですか？
nl_nl: overweeg om een `server_name` op te geven
sl_si: razmislite o navedbi imena strežnika `server_name`
sv_se: överväg att specifiera ett ´server_name`
uk_ua: спробуйте вказати `server_name`

source: another server is also listening to `{}`
cs_cz: jiný server také odposlouchává na `{}`
ja_jp: 他のサーバはすでに`{}`にリスニングされています
nl_nl: een andere server luistert ook naar `{}`
sl_si: drug strežnik že posluša na `{}`
sv_se: en annan server lyssnar också på `{}`
uk_ua: інший сервер також прослуховує `{}`

source: also listened to here
cs_cz: také odposloucháváno odsud
ja_jp: ここにもリスニングされています
nl_nl: ook hier beluisterd
sl_si: tudi poslušal tukaj
sv_se: lyssnade också på här

source: another server listening to the same address has the same `server_name`
cs_cz: jiný server odposlouchávající na stejné adrese má stejný název `server_name`
ja_jp: すでに同じ`server_name`を使っているサーバーがあります
nl_nl: een andere server die naar hetzelfde adres luistert heeft dezelfde `server_name`
sl_si: drug strežnik, ki posluša isti naslov, ima isti `server_name`
sv_se: en annan server som lyssnar på samma adress har samma `server_name`
uk_ua: інший сервер який прослувоє цю адресу має такий самий `server_name`

source: previously specified here
cs_cz: původně definováno zde
ja_jp: すでにここに定義されました
nl_nl: eerder hier opgegeven
sl_si: predhodno naveden tukaj
sv_se: tidigare angivits här
uk_ua: попередньо вказано тут

source: server not listening to an address
cs_cz: server neodposlouchává adresu
ja_jp: サーバーはリスニングされていません
nl_nl: server luistert niet naar een adres
sl_si: strežnik ne posluša naslova
sv_se: servern lyssnar inte på en adress
uk_ua: сервер не прослуховує жодну адресу

source: consider specifying an address using: `listen`
cs_cz: zvažte specifikování adresy pomocí: `listen`
ja_jp: `listen`を使ってアドラスにリスニングされてはどうですか？
nl_nl: overweeg om een adres op te geven met: `listen`
sl_si: razmislite o določitvi naslova z uporabo: `listen`
sv_se: överväg att specifiera en adress med: `listen`
uk_ua: спробуйте вказати адресу через `listen`

source: invalid port
cs_cz: neplatný port
ja_jp: 無効なポートです
nl_nl: ongeldige poort
sl_si: neveljaven prehod
sv_se: ogiltig port
uk_ua: некоректний порт

source: invalid number
cs_cz: neplatné číslo
ja_jp: 無効な数字です
nl_nl: ongeldig nummer
sl_si: neveljavna številka
sv_se: ogiltigt nummer
uk_ua: некоректне число

source: redefinition of max_body_size
cs_cz: redefinice max_body_size
ja_jp: max_body_sizeが再定義されました
nl_nl: herdefinitie van max_body_size
sl_si: redefinicija max_body_size
sv_se: omdefiniering av max_body_size
uk_ua: переозначення max_body_size

source: previously defined here
cs_cz: původně definováno zde
ja_jp: すでにここで定義された
nl_nl: eerder hier gedefinieerd
sl_si: predhodno definiran tukaj
sv_se: tidigare definierad här
uk_ua: попередньо означено тут

source: invalid max_body_size
cs_cz: neplatné max_body_size
ja_jp: 無効なmax_body_size
nl_nl: ongeldige max_body_size
sl_si: neveljaven max_body_size
sv_se: ogiltig max_body_size
uk_ua: некоректний max_body_size

source: redefinition of {}
cs_cz: redefinice {}
ja_jp: {}が再定義されました
nl_nl: herdefinitie van {}
sl_si: redefinicija {}
sv_se: omdefiniering av {}
uk_ua: переозначення {}

source: duplicate {}
cs_cz: duplikát {}
ja_jp: 複数の`{}`
nl_nl: duplicaat {}
sl_si: podvojen {}
sv_se: duplikat {}
uk_ua: подвоєння {}

source: request handler
cs_cz: handler requestů
ja_jp: ハンドラー
nl_nl: verzoek behandelaar
sl_si: izvajalec zahtevkov
sv_se: begäranhanterare
uk_ua: обробник запитів

source: invalid header key
cs_cz: neplatný klíč v hlavičce
sl_si: neveljaven ključ glave
sv_se: ogiltig huvudnyckel
uk_ua: некоректний ключ заголовка

source: because of invalid character `{}`
cs_cz: kvůli neplatnému znaku `{}`
ja_jp: 無効の`{}`字を使っていますから
nl_nl: vanwege het ongeldige karakter `{}`
sl_si: zaradi neveljavnega znaka `{}`
sv_se: på grund av ogiltigt tecken `{}`
uk_ua: через некоректний символ `{}`

source: invalid header value
cs_cz: neplatná hodnota v hlavičce
ja_jp: 無効なヘッダコンテナ
nl_nl: ongeldige headerwaarde
sl_si: neveljavna vrednost glave
sv_se: ogiltigt huvudvärde
uk_ua: некоректне значення заголовка

source: because of a reserved control character `{}`
cs_cz: kvůli rezervovanému řídícímu znaku `{}`
ja_jp: `{}`という特別な文字を使っていますから
nl_nl: vanwege het ongeldige controlekarakter `{}`
sl_si: zaradi rezerviranega kontrolnega znaka `{}`
sv_se: på grund av ett reserverat kontrolltecken `{}`
uk_ua: чрез зарезервований службовий символ `{}`

source: redefinition of `set_header`
cs_cz: redefinice`set_header`
sl_si: redefinicija `set_header`
sv_se: omdefiniering av `set_header`
uk_ua: переозначення `set_header`

source: a previous definition with the same key will be overridden
cs_cz: předchozí definice se stejným klíčem bude přepsána
ja_jp: 同じキーを使っている定義が上書きされます
nl_nl: de vorige definitie met dezelfde sleutel zal worden overschreven
sl_si: predhodna definicija z isti ključem bo prepisana
sv_se: en tidigare definering med samma nyckel kommer skrivas över
uk_ua: попереднє означення з таким самим ключем буде замімено

source: not a number
cs_cz: není číslo
ja_jp: 数字ではありません
nl_nl: niet een nummer
sl_si: ni število
sv_se: inte ett nummer
uk_ua: не є числом

source: a number must only contain digits
cs_cz: číslo musí obsahovat pouze číslice
ja_jp: 数は数字だけでできます
nl_nl: een nummer moet alleen cijfers bevatten
sl_si: število mora vsebovati samo števke
sv_se: ett nummer får endast innehålla siffror
uk_ua: число май містити тільки цифри

source: number too large
cs_cz: číslo je příliš velké
ja_jp: 数字が大きすぎます
nl_nl: nummer te groot
sl_si: število preveliko
sv_se: för stort nummer
uk_ua: завелике число

source: maximum accepted value is {}
cs_cz: největší povolené hodnota je {}
ja_jp: {}以上は無効です
nl_nl: maximale waarde is {}
sl_si: največja sprejeta vrednost je {}
sv_se: högsta tillåtna värde är {}
uk_ua: найбільше допустиме значення це {}

source: a number must contain at least one digit
cs_cz: číslo musí obsahovat alespoň jednu číslici
ja_jp: 数字は少なくとも数字文字の一つで出来ていなくてはなりません
nl_nl: een nummer moet minimaal één cijfer bevatten
sl_si: število mora vsebovati vsaj eno števko
sv_se: ett nummer måste innehålla åtminstone en siffra
uk_ua: число має містити хоча б одну цифру

source: invalid directory listing option
cs_cz: neplatná možnost výpisu adresářů
ja_jp: 無効なディレクトリリスティング
nl_nl: ongeldige mapvermeldingsoptie
sl_si: neveljavna možnost za izpis map
sv_se: ogiltigt alternativ för mapp-listning

source: expected either `true` or `false`
cs_cz: očekáváno buď `true` nebo `false`
ja_jp: `true`か`false`が予想されます
nl_nl: verwachte `true` of `false`
sl_si: pričakovan ali `true` ali `false`
sv_se: förväntade antingen `true` eller `false`
uk_ua: очікувано або `true` або `false`

source: unknown directive `{}`
cs_cz: neznámý pokyn `{}`
ja_jp: 不明な命令`{}`です
nl_nl: onbekende instructie `{}`
sl_si: neznana direktiva `{}`
sv_se: okänt direktiv `{}`
uk_ua: невідома директива `{}`

source: did you mean `{}`?
cs_cz: měli jste na mysli `{}`?
ja_jp: `{}`を使おうとされましたか？
nl_nl: bedoelde u `{}`?
sl_si: ste mislili `{}`?
sv_se: menade du `{}`?
uk_ua: можливо ви мали на увазі `{}`?

source: unrooted handler
cs_cz: handler bez kořenu
ja_jp: 元のないハンドラー
nl_nl: ongewortelde behandelaar
sl_si: neukoreninjen upravljalnik
sv_se: orotad hanterare
uk_ua: обробник запитів без кореневого шляху

source: consider rooting it using: `root`
cs_cz: zvažte přidání kořenu pomocí: `root`
ja_jp: `root`をお使いになってはどうですか？
nl_nl: overweeg om het te wortellen met: `root`
sl_si: razmislite o ukoreninjenju z uporabo: `root`
sv_se: överväg att rota den med: `root`
uk_ua: спробуйте вказати кореневий шлях через `root`

source: fifo
ja_jp: ファイフォー
nl_nl: wachtrij
sv_se: först-in-först-ut
