Repository: DutChen18/cobra
Catalog: locale/lol_us.po
Languages: lol_us

source: path to configuration file
lol_us: OH NOES! Teh path to teh configuration file iz missin. Halp me find it? Kthxbai.

source: number of threads to use (implies -t)
lol_us: Cheezburgers needed: 42. Implies -t. Moar threads, moar fun!

source: write diagnostics in json format
lol_us: I can has diagnostics in JSON format? Kthx. XD

source: exit after reading configuration file
lol_us: Bye-bye! Exiting after reading teh configuration file.

source: display this help message
lol_us: Halp! Teach me how to halp with this message. Kthx!

source: use the thread pool executor
lol_us: Diving into teh thread pool executor. Splish splash!

source: show verbose output
lol_us: Oh hai verbosity! Plz show me all teh outputz.

source: error
lol_us: OH NOES! Errorz attack! Abort, retry, fail?

source: warning
lol_us: Ohai! Warningz in da house. Pay attention, hooman.

source: note
lol_us: Just a lil note to remind you: I can has notez too!

source: unexpected EOF
lol_us: OOF! Unexpected End of File. Iz this teh end?

source: expected `{}`
lol_us: Expected some {0}. But got none {0}. Sad cat is sad.

source: unexpected `{}`
lol_us: LOL! Didn't expect {}. Surprise, surprise!

source: unexpected word
lol_us: Wat is dis word, hooman? Teach me teh human languagez.

source: consider replacing `{}` with `{}`
lol_us: Maybe try replacing dis {} with dis {}? Just sayin'.

source: unclosed quote
lol_us: OH NOES! Unclosed quote. Plz close it before I get lost.

source: invalid word
lol_us: I can haz invalid wordz? No can do, fren.

source: expected at least one character
lol_us: Plz give me at least one character. Kthx.

source: expected at least one graphical character
lol_us: Gimme graphical characterz, not just random stuff!

source: regular file
lol_us: Ohai! I'm a regular file, not a fancy one.

source: directory
lol_us: Just a regular directory, nothing to see here.

source: symlink
lol_us: I'm a magical symlink, leading nowhere and everywhere.

source: block device
lol_us: I'm a block cat, not a block chain. Meow.

source: character device
lol_us: Call me Kitty Device! I'm a character device, rawr!

source: fifo
lol_us: FIFO at ur service. Me haz dataz for u.

source: socket
lol_us: Squeaky clean socket, ready for communication!

source: unknown
lol_us: I'm in ur code, doing unexpected stuffz.

source: failed to stat file
lol_us: OH NOES! Failed to stat file. Iz it hiding from me?

source: not a normal file
lol_us: Not a normal file, but what is "normal" anyway?

source: is a directory
lol_us: OH NOES! I'm a directory, not a file! Halp, file needed!

source: not an executable file
lol_us: I'm not executable, unlike my dreams of catching red dot.

source: invalid response code
lol_us: Error: Invalid response code. Did I break teh internetz?

source: invalid redirect code
lol_us: Oh snap! Invalid redirect code. Who's playing tricks?

source: suspicious redirect code
lol_us: Suspicious much? Redirect looks fishy to me.

source: did you mean one of: {}, {}, {}, {}?
lol_us: Did you mean: {}, {}, {}, {}? Or none of the above? LOL.

source: not a directory
lol_us: Not a directory, not a file. Wat am I even?

source: is a {}
lol_us: Wat even is dis? I'm a {} apparently.

source: empty filter
lol_us: OH NOES! Filter is empty. No can haz empty filter!

source: consider specifying a handler using: `static`, `cgi`, etc...
lol_us: Add a handler plz. Use: `static`, `cgi`, or somethin'.

source: a address cannot be listened to with and without ssl at the same time
lol_us: OH NOES! I can't listen to dis address with and without SSL. Pick one, hooman!

source: consider listening to another address
lol_us: Maybe try listening to another address? Just an idea.

source: previously listened to here without ssl
lol_us: SSL and non-SSL clashed here before. Awkward.

source: previously listened to here with ssl
lol_us: SSL vs. non-SSL fight again! Someone's gotta yield.

source: ambiguous server
lol_us: Hooman, you confuse me. Who am I really listening to?

source: consider specifying a `server_name`
lol_us: Confuzzled cat is confuzzled. Specify a `server_name`, plz?

source: another server is also listening to `{}`
lol_us: Another server be stealin' mah address! HISS!

source: also listened to here
lol_us: Remember me? I listened here before.

source: another server listening to the same address has the same `server_name`
lol_us: Ohai, another server be eavesdroppin' on teh same address with teh same `server_name`. Wat a coincidence! LOL.

source: previously specified here
lol_us: I said it here first! No take-backsies!

source: server not listening to an address
lol_us: Server not listenin' to address. Plz use `listen`.

source: consider specifying an address using: `listen`
lol_us: Maybe try telling me where to listen using: listen? Meow.

source: invalid port
lol_us: Port failz. Invalid number. Make it real, plz.

source: invalid number
lol_us: OH NOES! Invalid number! Me no understand dis gibberish. Numbers, not chaos, plz.

source: redefinition of max_body_size
lol_us: Wat u think, redefining max_body_size? Nope.

source: previously defined here
lol_us: I remember dis from b4. U changed ur mind, huh?

source: invalid max_body_size
lol_us: Max body size failz. No can do, fren.

source: redefinition of {}
lol_us: OH NOES! Something's {}. Duplicates be cray cray!

source: duplicate {}
lol_us: Double trouble! U copied {}. That's not nice.

source: request handler
lol_us: Look, a wild request handler appeared! Captcha, plz.

source: invalid header key
lol_us: Header key failz. Invalid character. Plz no.

source: invalid header value
lol_us: Invalid header value. Control urself, hooman!

source: because of a reserved control character `{}`
lol_us: Because of a reserved control character `{}`. Me no like dis control.

source: redefinition of `set_header`
lol_us: Redefined `set_header`. Overriding like a boss.

source: a previous definition with the same key will be overridden
lol_us: Uh-oh, same key, different value. Who will win?

source: not a number
lol_us: Oh noez! Not a number! I can haz digits, plz?

source: a number must only contain digits
lol_us: Numbers only, kthx. No alphabet soup, plz.

source: number too large
lol_us: Numberz too big for my tiny paws. Plz resize.

source: maximum accepted value is {}
lol_us: Ohai! Maximum accepted value is {}. Don't go overboard!

source: a number must contain at least one digit
lol_us: At least one digit, hooman. Count to one. Meow.

source: invalid directory listing option
lol_us: Invalid directory listing option? Is that a thing?

source: expected either `true` or `false`
lol_us: True or false, hooman? Pick one and stick with it!

source: unknown directive `{}`
lol_us: I can haz unknown directive? Did you mean `{}`?

source: did you mean `{}`?
lol_us: OH NOES! Failed to understand. Did you mean `{}`? Speak cat, plz.

source: unrooted handler
lol_us: Unrooted handler, lost in the void. Plz root me.

source: consider rooting it using: `root`
lol_us: I'm growing roots now! Rooted and proud!
