Repository: DutChen18/cobra
Catalog: locale/tok_TOK.po
Languages: tok

source: path to configuration file
tok: ma pi lipu nasin

source: number of threads to use (implies -t)
tok: nanpa pi jan pali

source: write diagnostics in json format
tok: o sitelen lon nasin "json"

source: exit after reading configuration file
tok: o lukin e lipu nasin, o tawa

source: display this help message
tok: o pana e toki ni

source: use the thread pool executor
tok: o kepeken e jan pali mute

source: show verbose output
tok: o pana e sona mute

source: error
tok: pakala

source: warning
tok: toki ike

source: note
tok: toki

source: unexpected EOF
tok: pini lipu pakala

source: expected `{}`
tok: `{}` pona

source: unexpected `{}`
tok: `{}` pakala

source: unexpected word
tok: nimi pakala

source: consider replacing `{}` with `{}`
tok: sina o weka e `{}` o sin e `{}`

source: unclosed quote
tok: sitelen pi nimi mute li jo ala e pini

source: invalid word
tok: nimi pakala

source: expected at least one character
tok: sitelen wan pona anu sitelen mute pona

source: expected at least one graphical character
tok: sitelen lukin wan pona anu sitelen lukin mute pona

source: regular file
tok: lipu

source: directory
tok: kulupu lipu

source: symlink
tok: lipu pi ma ante

source: block device
tok: lipu leko

source: character device
tok: lipu sitelen

source: fifo
tok: lipu linja

source: socket
tok: lipu toki

source: unknown
tok: lipu pi sona ala

source: failed to stat file
tok: sona lipu li pakala

source: not a normal file
tok: lipu nasa

source: is a directory
tok: ona li kulupu lipu

source: not an executable file
tok: lipu pali ala

source: invalid response code
tok: nanpa ilo pakala

source: invalid redirect code
tok: nanpa ilo pakala

source: suspicious redirect code
tok: nanpa ilo nasa

source: did you mean one of: {}, {}, {}, {}?
tok: `{}` en `{}` en `{}` en `{}` li pona

source: not a directory
tok: kulupu lipu ala

source: is a {}
tok: ona li {}

source: empty filter
tok: ilo pali li jo ala

source: a address cannot be listened to with and without ssl at the same time
tok: o ken ala kute tawa nimi ma kepeken "ssl" kepeken ala "ssl" lon tenpo sama

source: consider listening to another address
tok: sina o kute tawa nimi ma ante

source: previously listened to here without ssl
tok: tenpo pini la, ona li kute lon ma ni kepeken ala "ssl"

source: previously listened to here with ssl
tok: tenpo pini la, ona li kute lon ma ni kepeken "ssl"

source: consider specifying a `server_name`
tok: sina o sin e `server_name`

source: another server is also listening to `{}`
tok: ilo ante li kute tawa `{}`

source: also listened to here
tok: kin la, lon ma ni

source: another server listening to the same address has the same `server_name`
tok: ilo ante li kute tawa nimi ma sama li jo e `server_name` sama

source: previously specified here
tok: tenpo pini la, ona li lon ma ni

source: server not listening to an address
tok: ilo li kute ala tawa nimi ma

source: consider specifying an address using: `listen`
tok: sina o sin e nimi ma kepeken `listen`

source: invalid port
tok: nanpa ma pakala

source: invalid number
tok: nanpa pakala

source: redefinition of max_body_size
tok: "max_body_size" tu

source: previously defined here
tok: tenpo pini la, ona li lon ma ni

source: invalid max_body_size
tok: "max_body_size" pakala

source: redefinition of {}
tok: "{}" tu

source: duplicate {}
tok: {} tu

source: request handler
tok: ilo pali

source: because of invalid character `{}`
tok: tan sitelen pakala `{}`

source: invalid header value
tok: nimi sinpin pakala

source: because of a reserved control character `{}`
tok: tan sitelen lawa pakala `{}`

source: a previous definition with the same key will be overridden
tok: nimi pini pi nimi open sama li kama weka

source: not a number
tok: nanpa ala

source: a number must only contain digits
tok: nanpa li wile jo e sitelen nanpa taso

source: number too large
tok: nanpa suli pakala

source: maximum accepted value is {}
tok: nanpa suli nanpa wan li {}

source: a number must contain at least one digit
tok: nanpa li wile jo e sitelen nanpa wan any sitelen nanpa mute

source: invalid directory listing option
tok: nasin pakala pi kulupu lipu

source: expected either `true` or `false`
tok: `true` anu `false` li pona

source: unknown directive `{}`
tok: nimi `{}` pi sona ala

source: did you mean `{}`?
tok: sina wile e nimi `{}` anu seme?

source: unrooted handler
tok: ilo pali li jo ala e open

source: consider rooting it using: `root`
tok: sina o pana e open tawa ona kepeken `root`
